Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: TOLONG ANTARKAN
en: why don’t you

source: KAYAKNYA HOTEL, YA?
en: it looks like a hotel.

source: Oiya, jangan pernah menginjakkan kaki ke dalam kamar!
en: one more thing, do not enter the room!

source: Naiklah jika kalian mau menyelamatkan anak-anak kalian!
en: get in if you want your children to live!

source: INI PERBUATAN
en: this was

source: TADI KAMI SUDAH
en: we’ve just presented you

source: TIBA-TIBA MAU
en: are you taking off

source: Sepertinya aku harus bertindak..
en: I think I should do something now.

source: NYA TERTIMPA BATU
en: got crushed by a rock,

source: ..LIHAT
en: you’ll

source: Saya juga gak suka orang sombong yang langsung membeli hape terbaru!!!
en: ...and I’m not a fan of people who can immediately purchase the newest phones!!!

source: MAH, BOLEH PINJAM HANDPHONE-NYA SEBENTAR?
en: honey, can I use your phone for a moment?

source: DOENGG
en: freeze

source: MUMPUNG MASIH
en: they’re just getting started,

source: MBAH..
en: master.

source: ITU YUK, DEK!
en: that tree!

source: SELESAI..!!
en: you know?!

source: BERANI-BERANINYA MENAKUTI SUAMIKU DAN MERUSAK RENCANA HONEYMOON KAMI!!!
en: how could you threaten my husband and ruin our honeymoon?!

source: Bukan hanya orang orang gila itu?!
en: I thought those people were the only things we needed to worry about.

source: MARKASMU ITU?!?!
en: your sacred base, huh?!

source: SABAR..
en: to hear that.

source: NYA, NIH..
en: what to say.

source: Cepats!!
en: now!

source: ALARM!!
en: my alarm!

source: SEMUA YANG TERJADI
en: to me

source: KITA BERTIGA
en: we don’t have

source: MOBIL?
en: here?

source: PERGI DARI SINI,
en: it’s not

source: TAPI TUNGGU..
en: wait...

source: KAKAK..?
en: natasya...?

source: AKU AKAN MEMINJAM-
en: think that I’d

source: Tidak perlu emosi, niat kami baik, kok...
en: don’t get us wrong. no need to get worked up.

source: BISA DITEBANG!!
en: all!

source: KESADISAN PAK J…
en: is no exception...

source: KAMU MASIH MAU
en: still want

source: GROAAA!!
en: roarrr

source: BARU DAPET DUIT,
en: for a couple hours

source: ..MEREKA SUDAH
en: he’s

source: KEJAYAANMU TELAH
en: days were

source: ORANG INI?
en: him?

source: PAK, HEHE..
en: hahaha...

source: Penjaga campground ini tidak kemana-mana,kok..
en: the guards won’t leave this campground.

source: TAMPANGNYA SAJA
en: from his looks alone,

source: ..SATU PER SATU
en: have suddenly died

source: SARIMIN, OHH..
en: tsk, tsk, tsk...

source: TEKNOLOGI!
en: now!

source: *Mendengus jahat*
en: snort of disgust

source: NYA..
en: interrupting...

source: MASSS!!!
en: in trouble!

source: DIREKTUR TINDAK PIDANA EKONOMI
en: by

source: FORMASI TENTANG
en: some information

source: AJA, YA?
en: go home now.

source: AKU MBAH!!
en: master!!!

source: KKKAHHH..!!
en: arghhh!!!

source: BANGUN!!!
en: wake up!

source: KARENA UANG
en: not joking,

source: TAHANLAH!!
en: mr. purnomo!

source: Selama masih ada sisa pohon keramat ini..
en: as long as there are pieces of the sacred tree left...

source: Kau pasti bisa!
en: you can do it!

source: PEKERJAAN LEBIH PENTING DARIPADA MENGHABISKAN WAKTU BERSAMAKU, YA?
en: he would rather be busy than spend time with me.

source: RAGU APAKAH INI
en: this wouldn’t

source: BU
en: smack

source: KAKIKU..!?
en: my leg...?!

source: MAKIN
en: bathing

source: PADANYA..
en: to him.

source: KITA INI SIAPA?
en: take us for?!

source: BANYAK KENANGAN
en: has

source: TAPI...
en: but...

source: Jadi, mah..
en: yes.

source: POHON ITU..
en: cut down that tree.

source: …EH?
en: huh?

source: JANGAN MARAH (6)
en: don’t be mad (6)

source: OLEH JANJI-JANJI
en: to me!

source: TIDAK BERGUNA!!
en: you useless brat!

source: J-JANGAN DEKAT-
en: stay away from me!

source: KEJAR MEREKA!!
en: after them!!!

source: ENAK SAJA!!
en: watch your mouth!

source: BIAR MEREKA TAHU
en: I want them

source: GERGAJINYA
en: stop

source: *TIBA-TIBA PANIK*
en: *panic attack*

source: UNTUK MEMINTA
en: and ask for

source: UANG SANTUNAN DAN
en: we had to burn

source: TERBUKA
en: it

source: ASUW--!!
en: ouch!!!

source: APA-APAAN INI?!
en: are you serious?!

source: NANTI KIRIMKAN SAJA VIDEONYA LEWAT WAZZAP MAMAH!
en: just send the video to my wazzap.

source: SESUATU, WOI!!
en: damn it!

source: MENUNGGU SAMPAI
en: won’t wait until tomorrow,

source: INI AKU PUN AKAN
en: with you,

source: AYAH MEMANG AGAK KELEWATAN TADI..
en: I know... your dad went too far.

source: ..SIAPAPUN
en: any sane person

source: BERJUANG MELAWAN
en: to defeat

source: TOLONG JANGAN
en: but please

source: MUNGKIN...
en: can’t be...

source: BUBARKAN ACARA ITU!!!
en: disband the group at once!

source: INI KERJAAN BOSKU..
en: my boss did this to me.

source: KAPALKU BERLAYAR!!
en: the ship has sailed!

source: BABI NGEPET
en: a demon boar

source: DI SINI!
en: ever again!

source: ..INI PASTI
en: I guess

source: DAN MENDERITA!!
en: and make you suffer!

source: TAMPAK KESAKI-
en: to be

source: UANGMU, PAK J..
en: your money, mr. J.

source: Dek???
en: are you okay, sweetie?

source: Kalau kamu mau sedikit bersabar, sebentar lagi aku akan mendapat tumbal lagi
en: if you can wait a little longer, I’ll help you until I find another human sacrifice.

source: BILANG APAPUN
en: don’t say anything

source: YANG SAMA DENGAN
en: the same field

source: SEPENUHNYA, KAN?!
en: now?!

source: TENAGA TADI..
en: with all that power...

source: Ayah kenapa mereka tidak kunjung bangun!?
en: why haven’t they woke up?

source: SEBENTAR LAGI SAMPAI KOK, KAK!
en: don’t worry, we should be there soon!

source: NYA?!?!
en: you order them?!

source: RIBU DOLLAR??
en: dollars?

source: MEREKA MENDIRIKAN
en: them build anything

source: Ayah janji mulai sekarang akan jadi ayah yang lebih baik buat kalian..
en: I’ll try to be a better dad for all of you, I promise.

source: SUDAH KUBERIKAN
en: the offering

source: Kupikir awalnya kamu hanya menginginkan si anak perempuan yang menyimpan benci terhadap ayahnya..
en: I thought at first that you were only interested in the daughter who secretly hated her father...

source: SAMA SEKALI!
en: budged at all!

source: MAU BERTAMASYA
en: take a walk

source: TIDAK MENGINSTRUKSI-
en: has never told us

source: ..AKU HARUS
en: I need to

source: JRE
en: shocked

source: K-KYAHH!!
en: ouchhh!

source: AMIT AMIT!!
en: hell no!

source: SEJAK KAPAN DEDEMIT BUTUH SENAM!?
en: since when do ghosts have to work out?!

source: ..WAJAH KAMI
en: his face was so close

source: TERLALU DEKAT..
en: you’re too close.

source: SENAM AEROBIK KALI INI ADALAH AEROBIK KHUSUS PEMULA, JADI MUDAH DIIKUTI GERAKAN-GERAKANNYA!
en: today’s routine is for beginners. so, it should be easy to follow!

source: MANUSIA PENG-
en: pesky

source: …LOH?!?!
en: huh?!

source: AYAHHH...
en: honey!

source: Nah jadi, apa rencana mu?
en: just tell me your plan.

source: DUK, DEK..
en: oh, no!

source: MATAKU
en: are so heavy

source: JADI KAMI CEK KE
en: so we went to

source: HEHEHE..
en: tee-hee!

source: Eh, sori, itumah kera yang lain, yak..
en: oops, we shouldn’t bring up other shows!

source: SELAMA AKU PERGI, YA!
en: the office while I’m out, okay?

source: TAP!
en: step

source: DIGANGGU!!
en: to be disturbed!

source: RAJIN IBADAH…
en: and get closer to god.

source: BUGH!!
en: pow

source: GAWAT, GAWAT,
en: we’re

source: Fyuhh..
en: phew...

source: LAGI DENGAN KAKI
en: with a leg

source: KAMU MAU
en: this could

source: AKAN
en: I’ll

source: BELIAU MASIH
en: the fight’s

source: PASTI PUNYA
en: of doing stuff

source: Atau tuan mau coba makan ceker ayam?
en: would you like to eat some chicken feet instead?

source: DEK?
en: it’s about time

source: MASUKLAH,
en: come in,

source: DI TEMPAT INI..!!
en: the boss around here!

source: BERGERAK!!
en: move!

source: EH, BUKAN..
en: uh... no,

source: *CEKLEK*
en: click

source: INI BUKAN DUNIA
en: in my own

source: AKU MENGA-TAKANNYA SEOLAH-OLAH PEKERJAAN SIALAN UITU LEBIH PENTING DARI PUTRIKU SENDIRI?!
en: I sounded as if my job was more important than my own daughter!

source: TERNYATA DIA BUKAN
en: hmm...

source: WAH, BAGUS YA, PEMANDANGANNYA!
en: wow... the scenery is breathtaking!

source: ANTARA KITA,
en: here.

source: Tidak udah ditambah bacotan yang lain!!
en: so don’t throw another nonsense at me!

source: JAWAB KAMI!!!
en: just say it!

source: RAMPOK, MAS SIAP
en: or a robber, I will

source: DIA PIKIR
en: he thinks

source: KALAU BUTUH TELPON-TELPON NANTI PAKAI HAPEKU SAJA!!
en: if you need to make a call, just use my phone.

source: PASTI AKAN MERASA
en: would be terrified

source: KAN UANG ITU
en: the money.

source: ..ASUMSIMU
en: your assumption

source: JANC*K!!!
en: f*ck!

source: AKU AKAN LEBIH
en: I’ll be

source: KAMU
en: you?!

source: JELAS-JELAS AKU MELIHAT BANYAK PENGUNJUNG LAINNYA YANG DATANG!!
en: there were other people here when we got here, and I saw them!

source: PAK SUNARYO MASIH
en: mr. sunaryo

source: INI DILUAR DUGAAN..
en: we didn’t expect this...

source: MENEMUKAN
en: found

source: BERLALU..
en: over.

source: JAM JENGUK RUMAH
en: but visiting hours

source: PERGINYA JIN
en: where is

source: SENDIRI DULU..!!
en: myself!

source: SEPERTINYA KAMU INI MONYET INDIGO..
en: I guess monkeys can have sixth sense too, huh?

source: BWOSH!
en: swoosh

source: SANTAI, MUNKI..!!
en: easy, munki!

source: TERLALU YAKIN DENGAN
en: to believe

source: IMUT DENGAN BAJU
en: in that

source: Kalau begitu cepat keluar dari kamarku, kuceng goreng pelit!!
en: then get out of my room, you lousy cheapskate!

source: SEMUA SUDAH DIATUR OLEH 'YANG DIATAS'
en: everything’s been planned out by the almighty.

source: SAJA?
en: the matter?

source: EEWWWHH!!
en: ew!

source: TAATI PERATURAN, DONG!!
en: follow the rules!

source: KAYAK KENAL..
en: I’ve seen him before.

source: NANTI AKU SITA BENERAN LHO HAPENYA!!
en: do I have to take that phone off of your hands for good?

source: MENYEPELEKAN PEMAKAIAN
en: still neglect

source: KEGELAPAN IT--
en: to suppress--

source: Sabar sayang, nanti aku belikan yang baru!
en: don’t worry, honey. I’ll get you another one!

source: JATUH KE JURANG SANA!!!
en: now, what do you want me to do?!

source: TAPI KUDENGAR..
en: I heard

source: TADI BENAR-BENAR
en: doesn’t

source: BERDEBAR..
en: was racing...

source: KIRI..
en: look left,

source: KAMAR?!
en: a room?!

source: U-UDAH, PAK..
en: um... that’s the end

source: AGAR KITA
en: we can

source: PULANG..
en: go home.

source: KAMU KANGEN
en: did you

source: NATASYA NGGAK ADA DI TENDA?!
en: she wasn’t in the tent?

source: KAMI MENEMUKANNYA!!
en: we found her!

source: KYAAHHHHH!!!
en: gyaaah!!!

source: YANG CUKUP
en: too much to

source: KERJA
en: an accident.

source: YAH, SEBENARNYA
en: well, I guess

source: NYETIR
en: man...

source: INGAT UMUR, DONG, MAH..
en: know your age, honey...

source: CUMA NUMPANG DI
en: not yours!

source: Setelah lama tidak bertemu, kemudian melihatmu seperti ini...
en: even though we haven’t seen each other in a long time, I can tell right away that...

source: RAPA SAAT LAGI..
en: later...

source: IKUT CAMPUR
en: mind your own business,

source: ADA
en: is real.

source: PERTEMUAN KITA INI
en: seriously.

source: NYA KALAU DI LAPANGAN!
en: when you work on a construction site!

source: OSH
en: (redacted)

source: HEI, DIT..
en: adit,

source: Seharusnya kau bisa langsung mengerti, Sarimin,,
en: you should’ve known, sarimin.

source: APA YANG SEDANG
en: what the hell

source: JIN BRENGSEK
en: this annoying jinn

source: CEKLEK!
en: click!

source: Bertemu dengan macan yang sangat besar..
en: I saw a giant tiger.

source: ANAKKU
en: all my son can do

source: APA YANG TER-
en: what’s

source: MENUNGGU SAYA
en: stay and wait here,

source: AKU LEBIH TUA
en: I’m older

source: CEPAT KEPUNG WANITA ITU!!!
en: everyone, get her!!!

source: YA AMPUN, AYAHHH..
en: honey, please!

source: Padahal ada kesempatan untuk mendapatkan 4 tumbal sekaligus..
en: it was possible to get four sacrifices at once...

source: Akhirnya satu masalah pergi juga..
en: one problem down, many more to go.

source: MELIHATNYA DENGAN
en: I don’t believe

source: Kalian saja yang tidak siap dengan perubahan
en: you know what, you simply aren’t ready for a change.

source: ANDA BAU
en: like

source: KAMU BERSYUKUR
en: should be grateful

source: MASIH ADA KELANJUTAN-
en: care to tell me

source: SESERAM KELIHATAN-
en: it’s not as scary

source: NYA JADI NAMBAH!!
en: do you?

source: DIBALIKIN, HAHA..
en: returned it to me.

source: SURAT-SURATNYA
en: I couldn’t find the deed

source: JAKETKUUUHH!??
en: my jacket?!

source: PANGGIL
en: call

source: BISA SAYA BANTU,
en: I help you,

source: Ayah..?
en: honey...

source: Aku tidak mau kasih janji palsu...
en: I don’t want to make empty promises to you.

source: Kelot serpis??
en: cloud what?

source: Amankan orang-orang ini!!!
en: get them!

source: LUKA RINGAN, HINGGA
en: were not too serious,

source: Aku pergi dulu
en: I need to go.

source: AW!!
en: ouch!

source: Honeymoon nya kayaknya harus ditunda dulu, silahkan kembali lagi di lain kesempatan
en: it looks like your honeymoon will have to wait, so please come back another time.

source: KHHH---
en: sob.

source: TAMPAK MENYEDIHKAN
en: the pathetic

source: BUKAN-- AW!!
en: the new--

source: TCH-!!
en: tsk,

source: GHOIB!??!
en: am I?!

source: *VISUALISASI HIPERBOLA SI PELAYAN HALU*
en: *this is what the delusional maid is fantasizing about*

source: MENYEDIHKAN..
en: pathetic!

source: TUMBEN PULANG
en: you’re

source: JAHAT..
en: here...

source: LATIHANNYA, BI..
en: for today, boary...

source: Ampunn, jangan laporkan saya ke boss saya!!!!
en: please, don’t report me to my boss!

source: YANG TIDAK BERES
en: gotta be

source: LAMATKAN DIRIKU
en: to save

source: HARUS MENGGUNAKAN
en: I need to use

source: Bukan Akun Haters/Fanbase
en: Not A Hate Account

source: NGGAK USAH NYUSUL!!
en: I want to be alone!

source: DEMI MEREKA..
en: to make them happy...

source: TIDAK ADA DI
en: at his

source: SENDIRI
en: to do the honors.

source: KETOK DULU, DONG!!
en: haven’t you heard of knocking?!

source: YA AMPUN, AYAHHH!!
en: oh no, honey!

source: HM…
en: hmm?

source: ASALKU MALAM INI
en: right this

source: SEJAK AWAL, MAKA-
en: wouldn’t have happened--

source: SEMPAT MELIHAT
en: I saw some darkness

source: SAAT MELAWANMU
en: after our last

source: ..SESUNGGUHNYA
en: what

source: AKU UDAH LAPER LAGI..
en: I’m hungry.

source: AKU MAU BACA
en: I wanna read

source: SEBELUM
en: you should’ve

source: KAMI TIDAK MAU
en: we don’t want

source: PAK..?
en: I mean...

source: BANTU AKU, MAS!!
en: h-help me!

source: YANG LEBIH PENTING
en: a more pressing matter

source: INI BARU NAIK GUNUNG DIKIT, WOY..
en: we haven’t even climbed that high!

source: MAS SIAP NANGKEP
en: I’ll catch you

source: SUDAH KUDUGA
en: I knew

source: DIA SANGAT GILA KERJA..
en: he’s a workaholic.

source: HANYA PERLU MEM-
en: to drain

source: HANYALAH BER-SAMAMU...
en: only with you~

source: UANG!?
en: money?!

source: PENYESALAN YANG
en: have

source: ADIT INI
en: this adit.

source: JANGAN MARAH (4)
en: don’t be mad (4)

source: PUTRI KAMI MASIH DI LUAR SANA, SAYA YAKIN ITU!!
en: I know our daughter is still out there!

source: JIMBUNG ITU?
en: bulus’s power?!

source: JADI SAYA TELAT
en: I should’ve

source: KECELAKAAN KERJA
en: this kind

source: AKU JADI SEDIKIT
en: I overheard

source: SAYANG BANGET NIH, KALAU SUDAH JAUH-JAUH KE SINI TAPI NGGAK BISA MENIK-MATI UDARA SEGAR DAN PEMANDANGAN SEINDAH INI, HEHEHE..
en: it would be such a waste if we couldn’t enjoy the fresh air and beautiful scenery, don’t you think? hehehe.

source: BENAR TERJADI
en: happened

source: Kalau itu saya dengar dari kepala pelayan..
en: I heard the butler said that...

source: AKU TIBA-TIBA KEPIKIRAN..
en: I’m thinking of something.

source: SATU ANAK BUAHKU
en: one of my men

source: GYAAAA!
en: gaaah!

source: TERIMA KASIH
en: thank you

source: TAPI KARENA KRISIS MONETER DAN MASALAH LAIN, PROYEKNYA DIHENTIKAN DAN MANGKRAK SAMPAI SEKARANG..
en: but because of the financial crisis and other problems, the project was stopped and has been put on hold until now.

source: SUARANYA
en: his voice

source: PAK..??
en: sir?

source: PALING MUDA DI
en: the youngest

source: IYA?!
en: what?

source: SENDIRI..?!
en: myself?!

source: ACT--!!
en: h-hey!

source: DI BAWAH POHONKU,
en: beneath my tree,

source: Wah, makasih...
en: oh, thank you so much.

source: ASTAGA, ANAK SIAPA, SIH?!
en: oh my god, what are you thinking?

source: BIAR ANAK-ANAK NGGAK DENGERIN LAGU CINTA-CINTA AN MULU!
en: it’s good for the kids so they don’t always listen to love songs!

source: KUAT UNTUK MENG-
en: strong enough

source: ANDA TERTAWA
en: laughing

source: MATAHARRI MULAI TERBENAM, HARI MULAI MALAM..
en: it’s getting dark.

source: TAJIR BENERAN,
en: and I mean totally rich.

source: HAH
en: huff

source: BEGINI, SIH..
en: like him...

source: MBAH SURO!!
en: master suro!

source: KUTUNJUKKAN
en: show you

source: K-KAKIKU
en: my leg!

source: *MENOLEH*
en: *glance*

source: SIH..
en: right...

source: SELAIN ITU..
en: a surprise for you.

source: SIAPA
en: who

source: APA-APAAN?!
en: what the heck?!

source: SUDAH
en: I swear

source: Via dusun Jaya
en: THROUGH JAYA VILLAGE

source: Tuan Sima?
en: master sima?

source: PERINGATKAN DARI
en: told

source: RUMAHNYA
en: house either.

source: Saya gak suka ya kalau dikit-dikit diviralin
en: those who make everything go viral irritate me to no end...

source: ORANG INI JUGA..
en: his life.

source: O NG!!
en: me!!!

source: SAAT ITU TAKKAN
en: never forget the fact

source: INI SEMUA SALAHKU..
en: it’s all my fault.

source: UNTUK IKHLAS?!
en: accept it?!

source: JUGA AKAN
en: you’d be

source: NGGAK ENAK, YA?
en: about this.

source: BUAHKU YANG MEM-
en: work for me

source: TERIMA KASIH!!
en: thank you!

source: AMBIL BROSUR INI,
en: you can keep this.

source: SAJA ADA…
en: course...

source: IYA KAN?
en: right?

source: SEJAK DULU!
en: the beginning!

source: PERAMPOKAN..
en: a robber,

source: TENDANYA YANG SEBELAH SINI YAA, PAK, BU..
en: the tent is over here, ma’am.

source: KERJAAN TADI!!
en: when he called me!

source: Apa maksudmu?!
en: what do you mean?

source: BETUL,
en: uh-huh,

source: KALIAN MENYERETKU
en: you’ve dragged me here

source: ADIKKU YANG NGGAK
en: dear brother,

source: TIBA-TIBA TRESNO
en: but then tresno said he needed

source: SAYA LANCANG, TAPI
en: but you’re

source: KU JUGA, AKU TAKKAN
en: of course

source: Begitulah, tuan,, untuk menekan biaya-biaya..
en: that’s what I heard. it’s to keep the costs down.

source: AKU TIDAK ANEH-
en: as long as

source: NOMOR YANG
en: the number

source: MBAH!!
en: master,

source: MALAM-MALAM
en: at this hour,

source: JASAKU..
en: a hassle.

source: YOUUUU!!!
en: you!!!

source: TIDAK YA, PUR..
en: purnomo.

source: MBAK NGAPAIN KOK
en: why were you snoozing

source: DI JALAN
en: while I’m driving.

source: HHAHA
en: hahaha

source: Obat bius?
en: drugged?

source: SIALAN!!
en: oh, crap,

source: KEBINGUNGAN
en: must be

source: SIAPA ITU!?
en: who’s there?!

source: MEMBIAYAI KULIAH
en: my sister’s tuition fee.

source: PERBUAT, MANUSIA..
en: of so many destructions.

source: POKOKNYA JANGAN KABUR-KABUR LAGI..
en: don’t run off again, okay?

source: WHOAHH!!!
en: whoa!!!

source: NYA..!!
en: his punches!

source: Dengar, aku hanya melakukan pekerjaanku!!
en: look, I’m just doing my job right now.

source: MUNGKIN TERJADI
en: does happen.

source: KAMU?
en: talking about?

source: ..TAPI BIAR
en: but...

source: LEBIH MUDAH,
en: been less complicated than this,

source: KE SUATU TEMPAT!!
en: and I’m in a free fall...

source: GIMANA CARANYA?!
en: but, how?!

source: SEPERTINYA KAKI-
en: he has

source: BAIKLAH,
en: okay,

source: MAU KEMANA KAU,
en: where do you think

source: IYA, MAH..
en: okay, sorry.

source: LAGI TERMAKAN
en: mean nothing

source: KABUR BUAT FOYA-FOYA
en: and run away

source: AKU BISA MERASAKANNYA, MBAH SURO!!
en: I could feel it, master suro!

source: DIA MASIH MEM-
en: I know

source: TOL..
en: help

source: BERHENTI BEKERJA
en: had to stop working

source: WAH..
en: whoa...

source: IHH, SEPI BANGET
en: this place gives

source: TADI…
en: did...

source: AKU LUMAYAN
en: so, I’m quite familiar with

source: SEKALIAN BAWA
en: always bring some

source: JALAN-NYA LICIN...
en: the road is so slippery.

source: SEMAKIN LAMA IA SEMAKIN SULIT UNTUK DIAJAK FAMILY-TIME..
en: lately, it’s been hard for us to have some quality time together.

source: EH, TAPI SETELAH ITU BUKANNYA AKU TINGGAL BUAT ANGKAT TELPON DARI MIRA?!
en: wait... mira called, so I had to leave the stove to answer it.

source: TAPI SETIAP HARI PUN...
en: everyday.

source: SEBULAN
en: his hair for a month

source: *JALAN BOBROQ*
en: *a bumpy road*

source: DIPINDAHIN GAK,
en: move

source: HEBAT DI MUKA
en: in this world,

source: BISA TOLONG
en: can you

source: JANGAN TINGGALKAN
en: don’t

source: MANTAP!
en: AWESOME!

source: KATA-KATA
en: last

source: COBA SINI PINJAM BENTAR, YAH..
en: give them to me.

source: GYAAHH!!
en: gaaah!!!

source: CONTOHNYA
en: like what you were

source: DAN NASIB BURUK?
en: and bad luck?

source: Tuan Sarimin bawa aku bersama mu!!!!
en: mr. sarimin, please take me with you!!!

source: Semua ini demi kebaikan desa dan kita semua!
en: and what we’re doing now benefits our community!

source: ENYAHLAH!!
en: get out of my face!

source: DARIPADA
en: instead

source: MAS AKU ATUT!!
en: I’m scared!

source: CURANG KAMU!!
en: stop!

source: GAH-!
en: gaaah-!

source: TAPI KUMOHON
en: but please

source: CUKUP MENARIK, APA
en: is quite interesting.

source: BAGAIMANA INI?
en: what do I do now?

source: SEBE..
en: before

source: EH?!
en: huh?

source: APAPUN
en: anything.

source: KK!
en: (redacted)

source: DEMI MEWARISI TRADISI TURUN TEMURUN YANG MEMAKMURKAN SEMUANYA
en: ...its stories have been kept under wraps.

source: DIVA JUGA
en: diva didn’t

source: Kau harus melakukan sesuatu untuk mengumpulkan energi dari mereka lagi, setidaknya..
en: at least, we need to do something to get the energy from their souls.

source: LALU KAMU MENGIKUTINYA SAMPAI SINI?
en: and you followed him here?

source: IKUT MAS..
en: with me.

source: SINI, KOK!
en: from here. okay?!

source: JIN PENUNGGU
en: a jinn’s

source: MALAH LEBIH
en: your mouths,

source: MATI..?!
en: working?!

source: KASIHAN SEKALI,
en: poor man...

source: HM… DIA INI
en: hmm...

source: TAPI ANJAS NGGAK SAMPAI BANGUN, KAN?
en: I didn’t wake anjas up, did I?

source: KENAPA DIA
en: what’s

source: Seharusnya kau ambil keempat orang itu semuanya!!
en: you should’ve taken their children’s lives too!

source: MENEPATI
en: my

source: TAPI SEPERTINYA
en: but

source: Sebenarnya tidak alasan khusus..
en: there was no particular reason.

source: INI KAN… YANG
en: just

source: BRUKK
en: thud

source: HAMPIR BERTEMU..
en: to mine.

source: ..KARENA ITULAH
en: that’s why

source: BIARKAN SAJA!
en: him be!

source: AIR DULU..
en: to pee.

source: MAU GIMANA
en: what else

source: DULU, HEHE..!!
en: hahaha...

source: RR
en: whirr

source: TENANG SAJA..
en: don’t worry,

source: JANGAN BIKIN PARNO
en: you’re making

source: Aku bisa jelaskan!!
en: I can explain!

source: YANG KITA UNDANG
en: our invited guest

source: Gapapa, nih, mah?
en: are you sure it’d be okay?

source: T-TAPI BAHAYA
en: but what do you mean,

source: NYERANGNYA
en: I expected

source: SI BUDAK KURA-
en: a softshell

source: Anu..
en: sorry...

source: SUARA APA ITU!?
en: what was that?!

source: SESAJEN?!?!
en: offerings?!

source: AKU SUDAH MERASA
en: I had a feeling

source: CEPAT!
en: hurry!

source: Iya, lho pak!
en: he’s right, sir.

source: SENDIRI!
en: this!

source: DARI KEMARIN
en: just

source: JALAN-JALAN?
en: some company?

source: TADI TIDURNYA..
en: so soundly.

source: SELAMA 40 HARI DI
en: at
